# =============================================================================
# Hyprland Dotfiles - Official Repository Packages
# =============================================================================
# Lines starting with # are comments
# One package per line

# -----------------------------------------------------------------------------
# Hyprland Core
# -----------------------------------------------------------------------------
hyprland
hyprlock
hypridle
hyprpicker
hyprpaper
hyprsunset
hyprland-guiutils

# -----------------------------------------------------------------------------
# UI Components
# -----------------------------------------------------------------------------
mako
waybar
wofi
rofi

# -----------------------------------------------------------------------------
# Terminal & Wayland
# -----------------------------------------------------------------------------
foot
fish
xorg-xwayland

# -----------------------------------------------------------------------------
# Screenshot & Recording
# -----------------------------------------------------------------------------
grim
slurp
imagemagick
wl-clipboard
wf-recorder

# -----------------------------------------------------------------------------
# Media & Audio
# -----------------------------------------------------------------------------
mpv
pulsemixer
pamixer
playerctl
pipewire
wireplumber
pipewire-pulse

# -----------------------------------------------------------------------------
# System Utilities
# -----------------------------------------------------------------------------
brightnessctl
python-pywal
libinput
upower
acpid
power-profiles-daemon

# -----------------------------------------------------------------------------
# Network & Bluetooth
# -----------------------------------------------------------------------------
networkmanager
bluez
bluez-utils

# -----------------------------------------------------------------------------
# Authentication
# -----------------------------------------------------------------------------
polkit-gnome
gnome-keyring

# -----------------------------------------------------------------------------
# Display Manager
# -----------------------------------------------------------------------------
sddm

# -----------------------------------------------------------------------------
# Desktop Portals
# -----------------------------------------------------------------------------
xdg-desktop-portal
xdg-desktop-portal-hyprland
xdg-desktop-portal-gtk

# -----------------------------------------------------------------------------
# Default Applications
# -----------------------------------------------------------------------------
thunar
thunar-archive-plugin
geany
firefox
viewnior

# -----------------------------------------------------------------------------
# Fonts
# -----------------------------------------------------------------------------
noto-fonts
noto-fonts-emoji
ttf-jetbrains-mono-nerd

# -----------------------------------------------------------------------------
# Editors & CLI Tools
# -----------------------------------------------------------------------------
nano
vim
btop

# -----------------------------------------------------------------------------
# Utilities
# -----------------------------------------------------------------------------
pastel
gsettings-desktop-schemas
polkit-gnome
